app/controllers/school_classes_controller.rb

  def update
    set_school_class
    set_school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-04-07 22:04:48.939527"], ["id", 1]]