app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-04-07 21:33:07.069369"], ["updated_at", "2018-04-07 21:33:07.069369"]]
---
  def create
    @student = Student.new(post_params)
    @student.save

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-04-07 21:53:26.503453"], ["id", 1]]
---
  def update
    set_student
    set_student.update(post_params)